
## Plan Result (prd)

[CI link](https://github.com/fumi-mura/tfaction-sample/actions/runs/17019068132)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to import, 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * aws_cloudwatch_log_group.test3
* Import
  * aws_cloudwatch_log_group.test3


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.test3 must be replaced
  # (imported from "test-cwlogs2")
  # Warning: this will destroy the imported resource
-/+ resource "aws_cloudwatch_log_group" "test3" {
      ~ arn               = "arn:aws:logs:ap-northeast-1:644370126241:log-group:test-cwlogs2" -> (known after apply)
      ~ id                = "test-cwlogs2" -> (known after apply)
        kms_key_id        = null
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "test-cwlogs2" -> "foo" # forces replacement
      + name_prefix       = (known after apply)
        region            = "ap-northeast-1"
      ~ retention_in_days = 30 -> 0
        skip_destroy      = false
      - tags              = {} -> null
        tags_all          = {
            "Env"                = "prd"
            "ManagedByTerraform" = "true"
        }
    }

Plan: 1 to import, 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":13,"Program":"tfcmt","SHA1":"359a71e038cc46cf33d061d3d9be9726be0fe55c","Target":"prd","Vars":{},"WorkflowName":"Terraform plan"} -->